app/views/gossips/index.html.erb

        <p class="card-text"><%= g.content %> </p>
          <p> <%= g.comments.count %> Comments<p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]