app/views/gossips/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
---

  <p> <%= @gossip.comments.count %> Comments<p>