app/controllers/comments_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "anonymous_commentor", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "c de la merde"], ["anonymous_commentor", "thmas"], ["gossip_id", 1], ["created_at", "2018-11-01 22:33:21.824604"], ["updated_at", "2018-11-01 22:33:21.824604"]]
---
  def create
  @gossip = Gossip.find(params[:gossip_id])
  @comment = @gossip.comments.create(params[:comment].permit(:anonymous_commentor, :content))