app/controllers/gossips_controller.rb

  def create
    @gossip = Gossip.create(title: params["gossip"]["title"], content: params["gossip"]["content"], anonymous_gossiper: params["gossip"]["anonymous_gossiper"])
---
INSERT INTO "gossips" ("title", "content", "anonymous_gossiper", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "THP C RENE"], ["content", "JEN AI MARRE"], ["anonymous_gossiper", "FDP"], ["created_at", "2018-10-31 15:38:39.711466"], ["updated_at", "2018-10-31 15:38:39.711466"]]

  def update
    @gossip = Gossip.find(params[:id])
    gossip_params = params.require(:gossip).permit(:title,:content,:anonymous_gossiper)
    @gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "anonymous_gossiper" = $3, "updated_at" = $4 WHERE "gossips"."id" = $5  [["title", "THP je triche"], ["content", "je comprend rien, que je copie colle les solutions"], ["anonymous_gossiper", "cheater"], ["updated_at", "2018-11-01 13:37:12.338477"], ["id", 1]]

  def destroy
    @gossip = Gossip.find(params[:id])
    @gossip.delete
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 1]]